itdogwowo/mp_lcd_bus/esp32_src/dsi_bus.c
    mp_lcd_dsi_bus_obj_t *self = m_new_obj(mp_lcd_dsi_bus_obj_t);
    memset(self, 0, sizeof(*self));
    self->base.type = &mp_lcd_dsi_bus_type;
    self->lane_count = lanes;
    self->panel_w = args[ARG_width].u_int;
    self->panel_h = args[ARG_height].u_int;
    self->reset_pin = args[ARG_rst].u_int;
    self->bits_per_pixel = bpp;
    self->num_fbs = nfbs;
    self->fb_size = (size_t)self->panel_w * self->panel_h * bpp / 8;
    self->queue_depth = qdepth;

    esp_err_t ret;

    esp_lcd_dsi_bus_config_t bc = {
        .bus_id = 0,
        .num_data_lanes = (uint8_t)lanes,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = mp_obj_get_float(args[ARG_lane_bit_rate_mbps].u_obj),
    };
    ret = esp_lcd_new_dsi_bus(&bc, &self->bus_handle);
    if (ret != ESP_OK) goto err_bus;

    esp_lcd_dbi_io_config_t dbi = {
        .virtual_channel = (uint8_t)args[ARG_virtual_channel].u_int,
        .lcd_cmd_bits = (uint8_t)args[ARG_cmd_bits].u_int,
        .lcd_param_bits = (uint8_t)args[ARG_param_bits].u_int,
    };
    ret = esp_lcd_new_panel_io_dbi(self->bus_handle, &dbi, &self->dbi_io);
    if (ret != ESP_OK) goto err_bus;

    float dpi_clk_mhz = 30.0f;
    if (args[ARG_dpi_clk_mhz].u_obj != MP_OBJ_NULL)
        dpi_clk_mhz = mp_obj_get_float(args[ARG_dpi_clk_mhz].u_obj);

    esp_lcd_dpi_panel_config_t dc = {
        .virtual_channel = (uint8_t)args[ARG_virtual_channel].u_int,
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = dpi_clk_mhz,
        .pixel_format = (bpp == 24) ? LCD_COLOR_PIXEL_FORMAT_RGB888 : LCD_COLOR_PIXEL_FORMAT_RGB565,
        .in_color_format = (bpp == 24) ? LCD_COLOR_FMT_RGB888 : LCD_COLOR_FMT_RGB565,
        .num_fbs = (uint8_t)nfbs,
        .video_timing = {
            .h_size = (uint32_t)self->panel_w,
            .v_size = (uint32_t)self->panel_h,
            .hsync_pulse_width = (uint32_t)args[ARG_hsync_pulse_width].u_int,
            .hsync_back_porch  = (uint32_t)args[ARG_hsync_back_porch].u_int,
            .hsync_front_porch = (uint32_t)args[ARG_hsync_front_porch].u_int,
            .vsync_pulse_width = (uint32_t)args[ARG_vsync_pulse_width].u_int,
            .vsync_back_porch  = (uint32_t)args[ARG_vsync_back_porch].u_int,
            .vsync_front_porch = (uint32_t)args[ARG_vsync_front_porch].u_int,
        },
        .flags = {
            .use_dma2d = args[ARG_use_dma2d].u_bool,
        },
    };
    ret = esp_lcd_new_panel_dpi(self->bus_handle, &dc, &self->dpi_panel);
    if (ret != ESP_OK) goto err_io;

    // grab the internal frame buffers (allocated by the driver in PSRAM)
    // note: fb_num must match the number of output pointers passed
    void *fb0 = NULL, *fb1 = NULL, *fb2 = NULL;
    if (esp_lcd_dpi_panel_get_frame_buffer(self->dpi_panel, (uint32_t)nfbs, &fb0, &fb1, &fb2) != ESP_OK)
        goto err_panel;
    self->fbs[0] = fb0;
    self->fbs[1] = fb1;
    self->fbs[2] = fb2;

    esp_lcd_dpi_panel_event_callbacks_t cbs = {
        .on_color_trans_done = on_color_trans_done,
        .on_refresh_done     = on_refresh_done,
    };
    ret = esp_lcd_dpi_panel_register_event_callbacks(self->dpi_panel, &cbs, self);
    if (ret != ESP_OK) goto err_panel;

    // optional hardware reset for the panel
    // (esp_lcd DPI panel has no reset_gpio support, so we manage it manually)
    if (self->reset_pin >= 0) {
        gpio_config_t gc = {
            .mode = GPIO_MODE_OUTPUT,
            .pin_bit_mask = 1ULL << self->reset_pin,
        };
        gpio_config(&gc);
        gpio_set_level(self->reset_pin, 0);
        mp_hal_delay_ms(20);
        gpio_set_level(self->reset_pin, 1);
        mp_hal_delay_ms(50);
    }

    // Note: esp_lcd_panel_reset() is NOT called — DPI panel driver doesn't
    // register a .reset callback and would return ESP_ERR_NOT_SUPPORTED.
    // The hardware reset above (if rst>=0) is the only reset mechanism.
    ret = esp_lcd_panel_init(self->dpi_panel);
    if (ret != ESP_OK) goto err_panel;

    // 註冊 PPA SRM client — write() 用它做硬體 2D blit (src → 後台 fb)。
    // use_dma2d=True (預設) 時才註冊；False 或註冊失敗 → write() 自動退回
    // CPU memcpy 路徑 (功能不受影響，只是 blit 佔 CPU)。
    // max_pending_trans_num=1: write() 用 BLOCKING 模式, 一次一筆即可。
    self->ppa_client = NULL;
    if (args[ARG_use_dma2d].u_bool) {
        ppa_client_config_t ppa_cfg = {
            .oper_type = PPA_OPERATION_SRM,
            .max_pending_trans_num = 1,
        };
        if (ppa_register_client(&ppa_cfg, &self->ppa_client) != ESP_OK) {
            self->ppa_client = NULL;   // 退回 CPU 路徑
        }
    }

    memset(self->ref_bufs, 0, sizeof(self->ref_bufs));
    memset(self->done_flags, 0, sizeof(self->done_flags));
    memset(self->pending_segments, 0, sizeof(self->pending_segments));
    memset(self->slot_kind, 0, sizeof(self->slot_kind));
    self->queue_head = self->queue_tail = self->queue_count = 0;
    self->cur_fb = 0;       // fb0 為初始顯示中; back_buffer()/present() 用 1-cur_fb 選離屏
    // 視窗預設全螢幕, 流式位置從 (0,0) 開始
    self->win_x0 = self->win_y0 = 0;
    self->win_x1 = self->panel_w - 1;
    self->win_y1 = self->panel_h - 1;
    self->pos_x = self->pos_y = 0;
    self->initialized = true;

    s_last_dsi = self;

    return MP_OBJ_FROM_PTR(self);

err_panel:
    // ⚠ 修復：reset GPIO 已被配置為 OUTPUT，錯誤路徑需釋放回 INPUT
    if (self->reset_pin >= 0) {
        gpio_config_t gc = {
            .mode = GPIO_MODE_INPUT,
            .pin_bit_mask = 1ULL << self->reset_pin,
        };
        gpio_config(&gc);
    }
    if (self->dpi_panel) esp_lcd_panel_del(self->dpi_panel);
err_io:
    if (self->dbi_io) esp_lcd_panel_io_del(self->dbi_io);
err_bus:
    // ⚠ 修復：esp_lcd_new_dsi_bus 失敗時 bus_handle 為 NULL，直接 del 會 assert/crash
    if (self->bus_handle) esp_lcd_del_dsi_bus(self->bus_handle);
    m_del_obj(mp_lcd_dsi_bus_obj_t, self);
    mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("DSI init failed err=0x%x"), ret);
}


static mp_obj_t dsi_write(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_buf, ARG_x, ARG_y, ARG_w, ARG_h };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self, MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_buf,  MP_ARG_OBJ | MP_ARG_REQUIRED },
        // 統一 API: x/y/w/h 是舊式顯式區域 (保留向後相容)。
        // 新用法: set_window() 設定視窗後 write(buf) 流式寫入。
        { MP_QSTR_x,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_y,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_w,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_h,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_READ);

    // ⚠ deinit 後 dpi_panel 為 NULL，直接使用會 use-after-free
    if (self->dpi_panel == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }

    bool explicit_region = (args[ARG_x].u_int != -1 || args[ARG_y].u_int != -1 ||
                            args[ARG_w].u_int != -1 || args[ARG_h].u_int != -1);

    int bpp = self->bits_per_pixel / 8;    // bytes per pixel
    size_t px_total = bufinfo.len / (size_t)bpp;   // 可寫像素數 (尾巴忽略)

    // 段表: 流式 write 可能跨行, 每段 = 一個 2D 矩形 (PPA 硬體 blit / CPU memcpy)。
    #define DSI_MAX_SEGS 600
    int seg_x[DSI_MAX_SEGS], seg_y[DSI_MAX_SEGS], seg_w[DSI_MAX_SEGS], seg_h[DSI_MAX_SEGS];
    int nsegs = 0;

    if (explicit_region) {
        // ── 舊式顯式區域: 一次拷貝, 不影響視窗/位置狀態 ──
        int x = args[ARG_x].u_int;
        int y = args[ARG_y].u_int;
        int w = args[ARG_w].u_int;
        int h = args[ARG_h].u_int;
        if (x == -1) x = 0;
        if (y == -1) y = 0;
        if (w == -1 || w == 0) w = self->panel_w - x;
        if (h == -1 || h == 0) h = self->panel_h - y;
        // clip 到面板範圍
        if (x < 0) x = 0;
        if (y < 0) y = 0;
        if (x + w > self->panel_w) w = self->panel_w - x;
        if (y + h > self->panel_h) h = self->panel_h - y;
        if (w > 0 && h > 0 && px_total > 0) {
            seg_x[0] = x; seg_y[0] = y;
            seg_w[0] = w; seg_h[0] = h;
            nsegs = 1;
        }
    } else {
        // ── 流式模式: 從視窗內 pos 開始寫, 逐段前進 (面板 RAMWR 模型) ──
        // 以「窗內線性偏移」追蹤位置，最簡且正確：
        //   L = (py-win_y0)*region_w + (px-win_x0)，範圍 [0, region_w*region_h)
        // 每段產出一個「真正的 2D 矩形」(seg_w × seg_h)：
        //   • 行首對齊且剩餘 ≥ 一整行 → 合併連續完整行 (w=region_w, h=n_rows)
        //   • 否則 → 寫到當前行尾 (w=剩餘像素, h=1)
        // 注意：合併行段的寬必須是 region_w（不是 n_rows*region_w），
        // 否則 PPA/CPU 2D blit 會把多行誤當超寬單行 → 畫面錯位。
        size_t region_w = (size_t)(self->win_x1 - self->win_x0 + 1);
        size_t region_h = (size_t)(self->win_y1 - self->win_y0 + 1);
        size_t region_px = region_w * region_h;
        size_t px_left = px_total;
        // 目前線性位置 (wrap 到窗內)
        size_t L = (size_t)(self->pos_y - self->win_y0) * region_w
                 + (size_t)(self->pos_x - self->win_x0);
        L %= region_px;
        while (px_left > 0 && nsegs < DSI_MAX_SEGS) {
            size_t row_off = L % region_w;        // 行內偏移
            size_t row     = L / region_w;        // 行號 (窗內)
            size_t seg_w_, seg_h_, n_px;
            if (row_off == 0 && px_left >= region_w) {
                // 行首對齊 → 合併連續完整行
                size_t n_rows = px_left / region_w;
                size_t rows_left = region_h - row;
                if (n_rows > rows_left) n_rows = rows_left;
                seg_w_ = region_w;
                seg_h_ = n_rows;
                n_px   = n_rows * region_w;
            } else {
                // 行中 (或剩餘不足一行) → 寫到當前行尾
                size_t row_left = region_w - row_off;
                n_px = px_left < row_left ? px_left : row_left;
                seg_w_ = n_px;
                seg_h_ = 1;
            }
            seg_x[nsegs] = self->win_x0 + (int)row_off;
            seg_y[nsegs] = self->win_y0 + (int)row;
            seg_w[nsegs] = (int)seg_w_;
            seg_h[nsegs] = (int)seg_h_;
            nsegs++;
            L = (L + n_px) % region_px;   // 前進並 wrap
            px_left -= n_px;
        }
        // 更新流式位置 (線性位置還原成 x/y)
        self->pos_x = self->win_x0 + (int)(L % region_w);
        self->pos_y = self->win_y0 + (int)(L / region_w);
    }

    if (nsegs == 0) {
        return mp_obj_new_int(0);    // 空寫入: 回傳 "0 tid" (同步完成, 不需 wait)
    }

    // ──────────────────────────────────────────────────────────────
    // 合約 (P4 + DSI + fb_count>=2 雙緩)：
    //   write(buf) 把像素搬到「後台 frame buffer」，絕不碰前台 → 零撕裂。
    //   present() 才在 VSYNC 原子切換。
    //
    // 搬運引擎 (依序選擇):
    //   1. PPA SRM (P4 的 DMA2D 硬體): 2D 硬體 blit, CPU 不碰像素。
    //      PPA 內部自動處理 cache (src C2M + dst M2C invalidate)。
    //      ⚠ PPA 的內部 msync 只接受 PSRAM 位址 → src 在 DRAM 時
    //        先 memcpy 到 PSRAM bounce (一次 CPU 拷貝, 之後仍是硬體搬)。
    //   2. CPU 逐行 memcpy (無 PPA / PPA 失敗時退回; fb_count==1 也可用)。
    // ──────────────────────────────────────────────────────────────
    int target_fb = (self->num_fbs >= 2) ? (1 - self->cur_fb) : 0;
    uint8_t *dst_fb = (uint8_t *)self->fbs[target_fb];
    const uint8_t *src = (const uint8_t *)bufinfo.buf;
    size_t src_off = 0;
    const int stride = self->panel_w * bpp;   // frame buffer 一行的 bytes
    ppa_srm_color_mode_t cm = (bpp == 3) ? PPA_SRM_COLOR_MODE_RGB888
                                         : PPA_SRM_COLOR_MODE_RGB565;
    // CPU fallback 寫過的外接矩形 (只 flush 這些區域 — 不能 flush PPA 寫過的
    // 區域: CPU cache 裡是舊值, C2M 會把舊值蓋回 PSRAM 覆蓋 PPA 的 DMA 結果)
    int crx = self->panel_w, cry = self->panel_h, crx2 = 0, cry2 = 0;

    for (int k = 0; k < nsegs; k++) {
        int x = seg_x[k], y = seg_y[k], w = seg_w[k], h = seg_h[k];
        size_t seg_bytes = (size_t)w * h * bpp;
        const void *blit_src = src + src_off;
        src_off += seg_bytes;

        bool done = false;
        if (self->ppa_client != NULL) {
            // DRAM src → PPA 內部 msync 會報 invalid addr → 先 bounce 到 PSRAM
            if (!_dsi_is_psram(blit_src)) {
                if (_dsi_ensure_bounce(self, seg_bytes)) {
                    memcpy(self->bounce_buf, blit_src, seg_bytes);
                    blit_src = self->bounce_buf;
                } else {
                    blit_src = NULL;   // bounce OOM → 本段退回 CPU
                }
            }
            if (blit_src != NULL) {
                ppa_srm_oper_config_t op = {0};
                op.in.buffer = blit_src;
                op.in.pic_w = w;
                op.in.pic_h = h;
                op.in.block_w = w;
                op.in.block_h = h;
                op.in.block_offset_x = 0;
                op.in.block_offset_y = 0;
                op.in.srm_cm = cm;
                op.out.buffer = dst_fb;
                op.out.buffer_size = self->fb_size;
                op.out.pic_w = self->panel_w;
                op.out.pic_h = self->panel_h;
                op.out.block_offset_x = x;
                op.out.block_offset_y = y;
                op.out.srm_cm = cm;
                op.rotation_angle = PPA_SRM_ROTATION_ANGLE_0;
                op.scale_x = 1.0f;
                op.scale_y = 1.0f;
                op.alpha_update_mode = PPA_ALPHA_NO_CHANGE;
                op.mode = PPA_TRANS_MODE_BLOCKING;   // 返回即完成, bounce 可安全重用
                if (ppa_do_scale_rotate_mirror(self->ppa_client, &op) == ESP_OK) {
                    done = true;
                }
            }
        }
        if (!done) {
            // CPU fallback: 逐行 memcpy (無 PPA、bounce OOM 或 PPA 報錯時)
            uint8_t *dp = dst_fb + (size_t)y * stride + (size_t)x * bpp;
            const uint8_t *sp = src + (src_off - seg_bytes);
            size_t row_bytes = (size_t)w * bpp;
            for (int r = 0; r < h; r++) {
                memcpy(dp, sp, row_bytes);
                dp += stride;
                sp += row_bytes;
            }
            // 累計 CPU 寫入的外接矩形
            if (x < crx) crx = x;
            if (y < cry) cry = y;
            if (x + w > crx2) crx2 = x + w;
            if (y + h > cry2) cry2 = y + h;
        }
    }

    // CPU fallback 寫後台 fb 走 write-back cache → 局部 C2M flush (僅 CPU 區域)。
    // (PPA 路徑已自己處理 cache, 不需再 flush; present() 也會再做整幀 msync)
    {
        int rw = crx2 - crx, rh = cry2 - cry;
        if (rw > 0 && rh > 0) {
            uint8_t *start = dst_fb + ((size_t)cry * self->panel_w + crx) * bpp;
            size_t bytes = (size_t)rw * rh * bpp;
            size_t max_bytes = dst_fb + self->fb_size - start;
            if (bytes > max_bytes) bytes = max_bytes;
            if (bytes > 0) {
                esp_cache_msync(start, bytes,
                                ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
            }
        }
    }

    // write() 同步完成，不佔用 queue 槽。
    // 回傳 tid=0 表示「不需要 wait」；上層呼叫 wait(0) 直接通過。
    return mp_obj_new_int(0);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_write_obj, 2, dsi_write);


