itdogwowo/mp_lcd_bus/esp32_src/dsi_bus.c
static mp_obj_t dsi_set_window(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_x0, ARG_y0, ARG_x1, ARG_y1 };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self, MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_x0,   MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_y0,   MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_x1,   MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_y1,   MP_ARG_INT | MP_ARG_REQUIRED },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    if (self->dpi_panel == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }
    int x0 = args[ARG_x0].u_int;
    int y0 = args[ARG_y0].u_int;
    int x1 = args[ARG_x1].u_int;
    int y1 = args[ARG_y1].u_int;
    // clip 到面板範圍
    if (x0 < 0) x0 = 0;
    if (y0 < 0) y0 = 0;
    if (x1 >= self->panel_w) x1 = self->panel_w - 1;
    if (y1 >= self->panel_h) y1 = self->panel_h - 1;
    if (x1 < x0 || y1 < y0)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("invalid window"));

    // 視窗語義 = 面板 CASET/PASET: 設定後 write() 從視窗左上角流式寫入
    self->win_x0 = x0;
    self->win_y0 = y0;
    self->win_x1 = x1;
    self->win_y1 = y1;
    self->pos_x = x0;
    self->pos_y = y0;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_set_window_obj, 1, dsi_set_window);


static mp_obj_t dsi_cmd(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_cmd, ARG_param };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self,  MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_cmd,   MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_param, MP_ARG_OBJ | MP_ARG_KW_ONLY, {.u_obj = MP_OBJ_NULL} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;

    // ⚠ deinit 後 dbi_io 為 NULL，直接使用會 use-after-free
    if (self->dbi_io == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }

    const void *param = NULL;
    size_t param_size = 0;
    if (args[ARG_param].u_obj != MP_OBJ_NULL) {
        mp_buffer_info_t pi;
        mp_get_buffer_raise(args[ARG_param].u_obj, &pi, MP_BUFFER_READ);
        param = pi.buf;
        param_size = pi.len;
    }

    esp_err_t ret = esp_lcd_panel_io_tx_param(self->dbi_io, args[ARG_cmd].u_int, param, param_size);
    if (ret != ESP_OK)
        mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("tx_param failed err=0x%x"), ret);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_cmd_obj, 2, dsi_cmd);


static mp_obj_t dsi_set_pattern(mp_obj_t self_in, mp_obj_t pat_in) {
    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)self_in;
    // ⚠ deinit 後 dpi_panel 為 NULL，直接使用會 use-after-free
    if (self->dpi_panel == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }
    int pat = mp_obj_get_int(pat_in);
    if (pat < 0 || pat > 3)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("pattern must be 0-3"));
    esp_err_t ret = esp_lcd_dpi_panel_set_pattern(self->dpi_panel, (mipi_dsi_pattern_type_t)pat);
    if (ret != ESP_OK)
        mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("set_pattern failed err=0x%x"), ret);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(dsi_set_pattern_obj, dsi_set_pattern);


static mp_obj_t dsi_frame_buffer(mp_obj_t self_in, mp_obj_t idx_in) {
    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)self_in;
    int i = mp_obj_get_int(idx_in);
    if (i < 0 || i >= self->num_fbs)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("frame buffer index out of range"));
    return mp_obj_new_bytearray_by_ref(self->fb_size, self->fbs[i]);
}
static MP_DEFINE_CONST_FUN_OBJ_2(dsi_frame_buffer_obj, dsi_frame_buffer);


static mp_obj_t dsi_flush(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_idx, ARG_x, ARG_y, ARG_w, ARG_h };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self, MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_idx,  MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_x,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 0} },
        { MP_QSTR_y,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 0} },
        { MP_QSTR_w,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 0} },
        { MP_QSTR_h,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 0} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    // ⚠ deinit 後 dpi_panel 為 NULL，直接使用會 use-after-free
    if (self->dpi_panel == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }
    int idx = args[ARG_idx].u_int;
    if (idx < 0 || idx >= self->num_fbs || self->fbs[idx] == NULL)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("frame buffer index out of range"));

    int x = args[ARG_x].u_int;
    int y = args[ARG_y].u_int;
    int w = args[ARG_w].u_int ? args[ARG_w].u_int : self->panel_w;
    int h = args[ARG_h].u_int ? args[ARG_h].u_int : self->panel_h;

    // clip 到面板範圍（與 esp_lcd_dpi_panel_draw_bitmap 同慣例）
    if (x < 0) x = 0;
    if (y < 0) y = 0;
    if (x + w > self->panel_w) w = self->panel_w - x;
    if (y + h > self->panel_h) h = self->panel_h - y;
    if (w <= 0 || h <= 0) return mp_const_none;

    // ⚠ ESP32-P4：frame buffer 在 PSRAM，CPU 寫入走 write-back L2 cache，
    // 而 DPI DMA 是直接讀 PSRAM（不經 cache）。frame_buffer() 零拷貝直寫
    // 之後若不 esp_cache_msync() 把髒行寫回，DMA 會一直讀到舊內容 —
    // 症狀就是「殘留/黑帶/閃爍」。flush() 就是把指定區域的髒 cache line
    // 寫回 PSRAM（DIR_C2M），與 esp_lcd DPI driver 內部做法相同。
    //
    // ⚠ size 必須是矩形 (x..x+w, y..y+h) 佔用的位元組，不能用 panel_w * h：
    // 否則 x>0 / w<panel_w 時 start+size 會越過本 fb 範圍，esp_cache_msync
    // 回 ESP_ERR_INVALID_ARG (103)，也就是用戶看到的 invalid addr 錯誤。
    int bpp_bytes = self->bits_per_pixel / 8;
    uint8_t *fb_base = (uint8_t *)self->fbs[idx];
    // 按 cache line 把 size 擴到「所有受影響的行」— cache 是以 cache-line
    // 為單位回寫，行內局部寫入也需要該行完整的 cache 線被寫回。
    // 為安全起見：從 (y 行起始) 到 (y+h-1 行結束) 的整行區間做 msync，
    // 因為 start 可能不對齊，UNALIGNED flag 已處理頭尾不對齊；
    // 但 size 只覆蓋 w*h*bpp 也正確 (UNALIGNED 會把頭尾對齊到 cache line)。
    size_t size = (size_t)w * h * bpp_bytes;
    uint8_t *start = fb_base + ((size_t)y * self->panel_w + x) * bpp_bytes;
    // ⚠ 邊界防衛：start+size 不超過本 fb 尾端（避免 esp_cache_msync invalid addr）
    size_t max_size = fb_base + self->fb_size - start;
    if (size > max_size) size = max_size;
    if (start >= fb_base && start < fb_base + self->fb_size && size > 0) {
        esp_cache_msync(start, size, ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_flush_obj, 1, dsi_flush);


static mp_obj_t dsi_is_busy(mp_obj_t self_in) {
    return mp_obj_new_bool(((mp_lcd_dsi_bus_obj_t *)self_in)->queue_count > 0);
}
static MP_DEFINE_CONST_FUN_OBJ_1(dsi_is_busy_obj, dsi_is_busy);

static mp_obj_t dsi_pending(mp_obj_t self_in) {
    return mp_obj_new_int(((mp_lcd_dsi_bus_obj_t *)self_in)->queue_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(dsi_pending_obj, dsi_pending);

static mp_obj_t dsi_lane_count(mp_obj_t self_in) {
    return mp_obj_new_int(((mp_lcd_dsi_bus_obj_t *)self_in)->lane_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(dsi_lane_count_obj, dsi_lane_count);


static mp_obj_t dsi_wait(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_trans_id, ARG_timeout_ms };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self,       MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_trans_id,   MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_timeout_ms, MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    int tid = args[ARG_trans_id].u_int;

    // tid == 0: dsi_write 同步完成（新合約），不需要等，直接 true
    if (tid == 0) return mp_const_true;

    int to  = args[ARG_timeout_ms].u_int;
    int idx = tid - 1;

    if (idx < 0 || idx >= self->queue_depth) return mp_const_false;
    if (self->done_flags[idx]) return mp_const_true;

    mp_uint_t deadline = mp_hal_ticks_ms() + (to < 0 ? 10000 : to);
    while (!self->done_flags[idx]) {
        if (to >= 0 && mp_hal_ticks_ms() > deadline) return mp_const_false;
        mp_hal_delay_ms(1);
    }
    return mp_const_true;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_wait_obj, 2, dsi_wait);


static mp_obj_t dsi_wait_all(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_timeout_ms };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self,       MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_timeout_ms, MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    int to = args[ARG_timeout_ms].u_int;
    mp_uint_t deadline = mp_hal_ticks_ms() + (to < 0 ? 10000 : to);

